sckim/AVR328P/99_Archive/99_Archive/Native_C/AVR/USB button/mcu.h
/*H**************************************************************************
* NAME:         mcu.h
*----------------------------------------------------------------------------
* Copyright (c) 2006 Atmel.
*----------------------------------------------------------------------------
* RELEASE:      at90usb162-2enum-mouse_ms-1_0_1
* REVISION:     1.5
*----------------------------------------------------------------------------
* PURPOSE:
* SFR Description file for at90usb16.
*****************************************************************************/
#ifndef MCU_H
#define MCU_H

/*==========================*/
/* Predefined SFR Addresses */
/*==========================*/

/******************************************************************************/
#if defined(__ICCAVR__) || defined(__IAR_SYSTEMS_ASM__)
/******************************************************************************/

SFR_B(PINB,   0x03)   /* Input Pins, Port B                      */
SFR_B(DDRB,   0x04)   /* Data Direction Register, Port B         */
SFR_B(PORTB,  0x05)   /* Data Register, Port B                   */

SFR_B(PINC,   0x06)   /* Input Pins, Port C                      */
SFR_B(DDRC,   0x07)   /* Data Direction Register, Port C         */
SFR_B(PORTC,  0x08)   /* Data Register, Port C                   */

SFR_B(PIND,   0x09)   /* Input Pins, Port D                      */
SFR_B(DDRD,   0x0A)   /* Data Direction Register, Port D         */
SFR_B(PORTD,  0x0B)   /* Data Register, Port D                   */

SFR_B(TIFR0,  0x15)   /* Timer/Counter Interrupt Flag register 0 */
SFR_B(TIFR1,  0x16)   /* Timer/Counter Interrupt Flag register 1 */

SFR_B(PCIFR,  0x1B)   /* Pin Change Interrupt Flag Register      */

SFR_B(EIFR,   0x1C)   /* External Interrupt Flag Register        */
SFR_B(EIMSK,  0x1D)   /* External Interrupt Mask Register        */

SFR_B(GPIOR0, 0x1E)   /* General Purpose Register 0              */

SFR_B(EECR,   0x1F)   /* EEPROM Control Register                 */
SFR_B(EEDR,   0x20)   /* EEPROM Data Register                    */
SFR_W(EEAR,   0x21)   /* EEPROM Address Register                 */

SFR_B(GTCCR,  0x23)   /* General Purpose Register                */

SFR_B(TCCR0A, 0x24)   /* Timer/Counter 0 Control Register        */
SFR_B(TCCR0B, 0x25)   /* Timer/Counter 0 Control Register        */
SFR_B(TCNT0,  0x26)   /* Timer/Counter 0                         */
SFR_B(OCR0A,  0x27)   /* Timer/Counter 0 Output Compare Register */
SFR_B(OCR0B,  0x28)   /* Timer/Counter 0 Output Compare Register */

SFR_B(PLLCSR, 0x29)   /* PLL Control and Status Register         */

SFR_B(GPIOR1, 0x2A)   /* General Purpose Register 1              */
SFR_B(GPIOR2, 0x2B)   /* General Purpose Register 2              */

SFR_B(SPCR,   0x2C)   /* SPI Control Register                    */
SFR_B(SPSR,   0x2D)   /* SPI Status Register                     */
SFR_B(SPDR,   0x2E)   /* SPI I/O Data Register                   */

SFR_B(ACSR,   0x30)   /* Analog Comparator Control and Status Register */

SFR_B(DWDR,   0x31)   /* DebugWire Register                      */

SFR_B(SMCR,   0x33)   /* Sleep Mode Control Register             */
SFR_B(MCUSR,  0x34)   /* MCU Status Register                     */
SFR_B(MCUCR,  0x35)   /* MCU Control Register                    */

SFR_B(SPMCSR, 0x37)   /* Store Program Memory Control and Status Register */

SFR_W(SP,     0x3D)   /* Stack Pointer                           */
SFR_B(SREG,   0x3F)   /* Status Register                         */

SFR_B_EXT(WDTCR,   0x60)   /* Watchdog Timer Control Register for compatibility */
SFR_B_EXT(WDTCSR,  0x60)   /* Watchdog Timer Control Register                   */
SFR_B_EXT(CLKPR,   0x61)   /* Clock Prescale Register                           */
SFR_B_EXT(WDTCKD,  0x62)   /* Watchdog Timer Clock Divider and Early Interrupt  */

SFR_B_EXT(REGCR,   0x63)   /* Regulator Control Register */

SFR_B_EXT(OSCCAL,  0x66)   /* Oscillator Calibration Register                   */

SFR_B_EXT(PCICR,   0x68)   /* Pin Change interrupt enable                       */

SFR_B_EXT(EICRA,   0x69)   /* External Interrupt Control Register A             */
SFR_B_EXT(EICRB,   0x6A)   /* External Interrupt Control Register B             */

SFR_B_EXT(PCMSK0,  0x6B)   /* Pin Change interrupt mask                         */
SFR_B_EXT(PCMSK1,  0x6C)   /* Pin Change interrupt mask                         */

SFR_B_EXT(TIMSK0,  0x6E)   /* Timer/Counter 0 Interrupt Mask Register           */
SFR_B_EXT(TIMSK1,  0x6F)   /* Timer/Counter 1 Interrupt Mask Register           */

SFR_B_EXT(TCCR1A,  0x80)   /* Timer/Counter 1 Control Register A                */
SFR_B_EXT(TCCR1B,  0x81)   /* Timer/Counter 1 Control Register B                */
SFR_B_EXT(TCCR1C,  0x82)   /* Timer/Counter 1 Control Register C                */
SFR_W_EXT(TCNT1,   0x84)   /* Timer/Counter 1 Register                          */
SFR_W_EXT(ICR1,    0x86)   /* Timer/Counter 1 Input Capture Register            */
SFR_W_EXT(OCR1A,   0x88)   /* Timer/Counter 1 Output Compare Register A         */
SFR_W_EXT(OCR1B,   0x8A)   /* Timer/Counter 1 Output Compare Register B         */
SFR_W_EXT(OCR1C,   0x8C)   /* Timer/Counter 1 Output Compare Register C         */

SFR_B_EXT(UCSR1A,  0xC8)   /* USART1 Control and Status Register A              */
SFR_B_EXT(UCSR1B,  0xC9)   /* USART1 Control and Status Register B              */
SFR_B_EXT(UCSR1C,  0xCA)   /* USART1 Control and Status Register C              */
SFR_B_EXT(UCSR1D,  0xCB)   /* USART1 Control and Status Register D              */
SFR_W_EXT(UBRR1,   0xCC)   /* USART1 Baud Rate Register Low                     */
SFR_B_EXT(UDR1,    0xCE)   /* USART1 I/O Data Register                          */


// USB CONTROLLER
// USB General
// Page 1
SFR_B_EXT(USBCON,    0xD8);
SFR_B_EXT(UDPADDL,   0xDB);
SFR_B_EXT(UDPADDH,   0xDC);

// USB Device
// Page 1
SFR_B_EXT(UDCON,     0xE0);
SFR_B_EXT(UDINT,     0xE1);
SFR_B_EXT(UDIEN,     0xE2);
SFR_B_EXT(UDADDR,    0xE3);
SFR_B_EXT(UDFNUML,   0xE4);
SFR_B_EXT(UDFNUMH,   0xE5);
SFR_B_EXT(UDMFN,     0xE6);
SFR_B_EXT(UDTST,     0xE7);

