sckim/AVR328P/99_Archive/99_Archive/Native_C/AVR/USB button/mcu.h
// USB Endpoint
// Page 1
SFR_B_EXT(UENUM,     0xE9);
SFR_B_EXT(UERST,     0xEA);
SFR_B_EXT(UECONX,    0xEB);
SFR_B_EXT(UECFG0X,   0xEC);
SFR_B_EXT(UECFG1X,   0xED);
SFR_B_EXT(UESTA0X,   0xEE);
SFR_B_EXT(UESTA1X,   0xEF);
SFR_B_EXT(UEINTX,    0xE8);
SFR_B_EXT(UEIENX,    0xF0);
SFR_B_EXT(UEDATX,    0xF1);
SFR_B_EXT(UEBCLX,    0xF2);
SFR_B_EXT(UEINT,     0xF4);

// PS2 and USB
SFR_B_EXT(PS2CON,    0xFA);
SFR_B_EXT(UPOE,      0xFB);

// Clock Switching
SFR_B_EXT(CKSEL0,    0xD0);
SFR_B_EXT(CKSEL1,    0xD1);
SFR_B_EXT(CKSTA,     0xD2);


/*==============================*/
/* Interrupt Vector Definitions */
/*==============================*/
/* NB! vectors are specified as byte addresses */
#define    RESET_vect                  (0x00)
#define    INT0_vect                   (0x04)
#define    INT1_vect                   (0x08)
#define    INT2_vect                   (0x0C)
#define    INT3_vect                   (0x10)
#define    INT4_vect                   (0x14)
#define    INT5_vect                   (0x18)
#define    INT6_vect                   (0x1C)
#define    INT7_vect                   (0x20)
#define    PCINT0_vect	               (0x24)
#define    PCINT1_vect	               (0x28)
#define    USB_GENERAL_vect            (0x2C)
#define    USB_ENDPOINT_vect           (0x30)
#define    WDT_vect                    (0x34)
#define    TIMER1_CAPT_vect            (0x38)
#define    TIMER1_COMPA_vect           (0x3C)
#define    TIMER1_COMPB_vect           (0x40)
#define    TIMER1_COMPC_vect           (0x44)
#define    TIMER1_OVF_vect             (0x48)
#define    TIMER0_COMPA_vect           (0x4C)
#define    TIMER0_COMPB_vect           (0x50)
#define    TIMER0_OVF_vect             (0x54)
#define    SPI_STC_vect                (0x58)
#define    USART1_RXC_vect             (0x5C)
#define    USART1_UDRE_vect            (0x60)
#define    USART1_TXC_vect             (0x64)
#define    ANA_COMP_vect               (0x68)
#define    EE_RDY_vect                 (0x6C)
#define    SPM_RDY_vect                (0x70)
//#define                                (0x74)

#endif /* _IAR_ */
/******************************************************************************/
#ifdef __CODEVISIONAVR__
/******************************************************************************/

#define PINB    (*(volatile unsigned char *)0x23) /* Input Pins, Port B                      */
#define DDRB    (*(volatile unsigned char *)0x24) /* Data Direction Register, Port B         */
#define PORTB   (*(volatile unsigned char *)0x25) /* Data Register, Port B                   */

#define PINC    (*(volatile unsigned char *)0x26) /* Input Pins, Port C                      */
#define DDRC    (*(volatile unsigned char *)0x27) /* Data Direction Register, Port C         */
#define PORTC   (*(volatile unsigned char *)0x28) /* Data Register, Port C                   */

#define PIND    (*(volatile unsigned char *)0x29) /* Input Pins, Port D                      */
#define DDRD    (*(volatile unsigned char *)0x2A) /* Data Direction Register, Port D         */
#define PORTD   (*(volatile unsigned char *)0x2B) /* Data Register, Port D                   */

#define TIFR0   (*(volatile unsigned char *)0x35) /* Timer/Counter Interrupt Flag register 0 */
#define TIFR1   (*(volatile unsigned char *)0x36) /* Timer/Counter Interrupt Flag register 1 */

#define PCIFR   (*(volatile unsigned char *)0x3B) /* Pin Change Interrupt Flag Register      */

#define EIFR    (*(volatile unsigned char *)0x3C) /* External Interrupt Flag Register        */
#define EIMSK   (*(volatile unsigned char *)0x3D) /* External Interrupt Mask Register        */

#define GPIOR0  (*(volatile unsigned char *)0x3E) /* General Purpose Register 0              */

#define EECR    (*(volatile unsigned char *)0x3F) /* EEPROM Control Register                 */
#define EEDR    (*(volatile unsigned char *)0x40) /* EEPROM Data Register                    */
#define EEAR    (*(volatile unsigned int  *)0x41) /* EEPROM Address Register                 */

#define GTCCR   (*(volatile unsigned char *)0x43) /* General Purpose Register                */

#define TCCR0A  (*(volatile unsigned char *)0x44) /* Timer/Counter 0 Control Register        */
#define TCCR0B  (*(volatile unsigned char *)0x45) /* Timer/Counter 0 Control Register        */
#define TCNT0   (*(volatile unsigned char *)0x46) /* Timer/Counter 0                         */
#define OCR0A   (*(volatile unsigned char *)0x47) /* Timer/Counter 0 Output Compare Register */
#define OCR0B   (*(volatile unsigned char *)0x48) /* Timer/Counter 0 Output Compare Register */

#define PLLCSR  (*(volatile unsigned char *)0x49) /* PLL Control and Status Register         */

#define GPIOR1  (*(volatile unsigned char *)0x4A) /* General Purpose Register 1              */
#define GPIOR2  (*(volatile unsigned char *)0x4B) /* General Purpose Register 2              */

#define SPCR    (*(volatile unsigned char *)0x4C) /* SPI Control Register                    */
#define SPSR    (*(volatile unsigned char *)0x4D) /* SPI Status Register                     */
#define SPDR    (*(volatile unsigned char *)0x4E) /* SPI I/O Data Register                   */

#define ACSR    (*(volatile unsigned char *)0x50) /* Analog Comparator Control and Status Register */

#define DWDR    (*(volatile unsigned char *)0x51) /* DebugWire Register                      */

#define SMCR    (*(volatile unsigned char *)0x53) /* Sleep Mode Control Register             */
#define MCUSR   (*(volatile unsigned char *)0x54) /* MCU Status Register                     */
#define MCUCR   (*(volatile unsigned char *)0x55) /* MCU Control Register                    */

#define SPMCSR  (*(volatile unsigned char *)0x57) /* Store Program Memory Control and Status Register */

#define SP      (*(volatile unsigned int  *)0x5D) /* Stack Pointer                           */
#define SREG    (*(volatile unsigned char *)0x5F) /* Status Register                         */

#define WDTCR   (*(volatile unsigned char *)0x60) /* Watchdog Timer Control Register         */
#define CLKPR   (*(volatile unsigned char *)0x61) /* Clock Prescale Register                 */
#define OSCCAL  (*(volatile unsigned char *)0x66) /* Oscillator Calibration Register         */


#define PCICR   (*(volatile unsigned char *)0x68) /* Pin Change interrupt enable             */

#define EICRA   (*(volatile unsigned char *)0x69) /* External Interrupt Control Register A   */
#define EICRB   (*(volatile unsigned char *)0x6A) /* External Interrupt Control Register B   */

#define PCMSK0  (*(volatile unsigned char *)0x6B) /* Pin Change interrupt mask               */
#define PCMSK1  (*(volatile unsigned char *)0x6C) /* Pin Change interrupt mask               */

