sckim/AVR328P/99_Archive/99_Archive/Native_C/AVR/USB button/mcu.h
#define TIMSK0  (*(volatile unsigned char *)0x6E) /* Timer/Counter 0 Interrupt Mask Register */
#define TIMSK1  (*(volatile unsigned char *)0x6F) /* Timer/Counter 1 Interrupt Mask Register */

#define TCCR1A  (*(volatile unsigned char *)0x80) /* Timer/Counter 1 Control Register A      */
#define TCCR1B  (*(volatile unsigned char *)0x81) /* Timer/Counter 1 Control Register B      */
#define TCCR1C  (*(volatile unsigned char *)0x82) /* Timer/Counter 1 Control Register C      */
#define TCNT1   (*(volatile unsigned int  *)0x84) /* Timer/Counter 1 Register                */
#define ICR1    (*(volatile unsigned int  *)0x86) /* Timer/Counter 1 Input Capture Register  */
#define OCR1A   (*(volatile unsigned int  *)0x88) /* Timer/Counter 1 Output Compare Register A */
#define OCR1B   (*(volatile unsigned int  *)0x8A) /* Timer/Counter 1 Output Compare Register B */
#define OCR1C   (*(volatile unsigned int  *)0x8C) /* Timer/Counter 1 Output Compare Register C */

#define UCSR1A  (*(volatile unsigned char *)0xC8) /* USART1 Control and Status Register A    */
#define UCSR1B  (*(volatile unsigned char *)0xC9) /* USART1 Control and Status Register B    */
#define UCSR1C  (*(volatile unsigned char *)0xCA) /* USART1 Control and Status Register C    */
#define UBRR1   (*(volatile unsigned int  *)0xCC) /* USART1 Baud Rate Register               */
#define UBRR1L  (*(volatile unsigned char *)0xCC) /* USART1 Baud Rate Register Low           */
#define UBRR1H  (*(volatile unsigned char *)0xCD) /* USART1 Baud Rate Register High          */
#define UDR1    (*(volatile unsigned char *)0xCE) /* USART1 I/O Data Register                */

// USB CONTROLLER
// USB General
// Page 1
#define USBCON  (*(volatile unsigned char *)0xD8) /*   */
#define UDPADDL (*(volatile unsigned char *)0xDB) /*   */
#define UDPADDH (*(volatile unsigned char *)0xDC) /*   */

// USB Device
// Page 1
#define UDCON   (*(volatile unsigned char *)0xE0) /*   */
#define UDINT   (*(volatile unsigned char *)0xE1) /*   */
#define UDIEN   (*(volatile unsigned char *)0xE2) /*   */
#define UDADDR  (*(volatile unsigned char *)0xE3) /*   */
#define UDFNUML (*(volatile unsigned char *)0xE4) /*   */
#define UDFNUMH (*(volatile unsigned char *)0xE5) /*   */
#define UDMFN   (*(volatile unsigned char *)0xE6) /*   */
#define UDTST   (*(volatile unsigned char *)0xE7) /*   */

// USB Endpoint
// Page 1
#define UENUM   (*(volatile unsigned char *)0xE9) /*   */
#define UERST   (*(volatile unsigned char *)0xEA) /*   */
#define UECONX  (*(volatile unsigned char *)0xEB) /*   */
#define UECFG0X (*(volatile unsigned char *)0xEC) /*   */
#define UECFG1X (*(volatile unsigned char *)0xED) /*   */
#define UESTA0X (*(volatile unsigned char *)0xEE) /*   */
#define UESTA1X (*(volatile unsigned char *)0xEF) /*   */
#define UEINTX  (*(volatile unsigned char *)0xE8) /*   */
#define UEIENX  (*(volatile unsigned char *)0xF0) /*   */
#define UEDATX  (*(volatile unsigned char *)0xF1) /*   */
#define UEBCLX  (*(volatile unsigned char *)0xF2) /*   */
#define UEINT   (*(volatile unsigned char *)0xF4) /*   */

// PS2 and USB
#define PS2CON  (*(volatile unsigned char *)0xFA) /*   */
#define UPOE    (*(volatile unsigned char *)0xFB) /*   */

// Clock Switching
#define CKSEL0  (*(volatile unsigned char *)0xD0) /*   */
#define CKSEL1  (*(volatile unsigned char *)0xD1) /*   */
#define CKSTA   (*(volatile unsigned char *)0xD2) /*   */


/*==============================*/
/* Interrupt Vector Definitions */
/*==============================*/
/* NB! vectors are specified as byte addresses */
#define    RESET_vect           1
#define    INT0_vect            2
#define    INT1_vect            3
#define    INT2_vect            4
#define    INT3_vect            5
#define    INT4_vect            6
#define    INT5_vect            7
#define    INT6_vect            8
#define    INT7_vect            9
#define    PCINT0_vect          10
#define    PCINT1_vect          11
#define    USB_GENERAL_vect     12
#define    USB_ENDPOINT_vect    13
#define    WDT_vect             14
#define    TIMER1_CAPT_vect     15
#define    TIMER1_COMPA_vect    16
#define    TIMER1_COMPB_vect    17
#define    TIMER1_COMPC_vect    18
#define    TIMER1_OVF_vect	19	 					
#define    TIMER0_COMPA_vect    20 		
#define    TIMER0_COMPB_vect    21
#define    TIMER0_OVF_vect      22
#define    SPI_STC_vect         23
#define    USART1_RXC_vect      24
#define    USART1_UDRE_vect     25
#define    USART1_TXC_vect      26
#define    ANA_COMP_vect        27
#define    EE_RDY_vect          28
#define    SPM_RDY_vect         29

#endif /* _ICC_*/



/*==========================*/
/* Bit Position Definitions */
/*==========================*/
/* PINB : Input Pins, Port B */
#define    PINB7    7
#define    PINB6    6
#define    PINB5    5
#define    PINB4    4
#define    PINB3    3
#define    PINB2    2
#define    PINB1    1
#define    PINB0    0

/* DDRB : Data Direction Register, Port B */
#define    DDB7     7
#define    DDB6     6
#define    DDB5     5
#define    DDB4     4
#define    DDB3     3
#define    DDB2     2
#define    DDB1     1
#define    DDB0     0

/* PORTB : Data Register, Port B */
#define    PB7      7
#define    PB6      6
#define    PB5      5
#define    PB4      4
#define    PB3      3
#define    PB2      2
#define    PB1      1
#define    PB0      0

/* PORTB : Data Register, Port B */
#define    PORTB7   7
#define    PORTB6   6
#define    PORTB5   5
#define    PORTB4   4
#define    PORTB3   3
#define    PORTB2   2
#define    PORTB1   1
#define    PORTB0   0

/* PINC : Input Pins, Port C */
#define    PINC7    7
#define    PINC6    6
#define    PINC5    5
#define    PINC4    4
//#define    PINC3    3
#define    PINC2    2
#define    PINC1    1
#define    PINC0    0

/* DDRC : Data Direction Register, Port C */
#define    DDC7     7
#define    DDC6     6
#define    DDC5     5
#define    DDC4     4
//#define    DDC3     3
#define    DDC2     2
#define    DDC1     1
#define    DDC0     0

/* PORTC : Data Register, Port C */
#define    PC7      7
#define    PC6      6
#define    PC5      5
#define    PC4      4
//#define    PC3      3
#define    PC2      2
#define    PC1      1
#define    PC0      0

/* PORTC : Data Register, Port C */
#define    PORTC7   7
#define    PORTC6   6
#define    PORTC5   5
#define    PORTC4   4
//#define    PORTC3   3
#define    PORTC2   2
#define    PORTC1   1
#define    PORTC0   0

/* PIND : Input Pins, Port D */
#define    PIND7    7
#define    PIND6    6
#define    PIND5    5
#define    PIND4    4
#define    PIND3    3
#define    PIND2    2
#define    PIND1    1
#define    PIND0    0

