sckim/AVR328P/99_Archive/99_Archive/Native_C/AVR/USB button/mcu.h
/* UCSR1D : USART1 Control and Status Register D */
#define    CTSEN    1
#define    RTSEN    0

/* PCICR Pin Change Interrupt control */
#define    PCIE1    1
#define    PCIE0    0

/* PCIFR Pin Change Interrupt flag */
#define    PCIF1    1
#define    PCIF0    0

/* ***** USB_DEVICE ******************* */
/* UDCON -  */
#define    DETACH          0       //
#define    RMWKUP          1       //
#define    RSTCPU          2       //

/* UDINT -  */
#define    SUSPI           0       //
//#define    MSOFI           1       //
#define    SOFI            2       //
#define    EORSTI          3       //
#define    WAKEUPI         4       //
#define    EORSMI          5       //
#define    UPRSMI          6       //

/* UDIEN -  */
#define    SUSPE           0       //
//#define    MSOFE           1       //
#define    SOFE            2       //
#define    EORSTE          3       //
#define    WAKEUPE         4       //
#define    EORSME          5       //
#define    UPRSME          6       //

/* UDADDR -  */
#define    UDADDR0         0       //
#define    UDADDR1         1       //
#define    UDADDR2         2       //
#define    UDADDR3         3       //
#define    UDADDR4         4       //
#define    UDADDR5         5       //
#define    UDADDR6         6       //
#define    ADDEN           7       //

/* UDFNUML -  */
#define    UDFNUML_0       0       //
#define    UDFNUML_1       1       //
#define    UDFNUML_2       2       //
#define    UDFNUML_3       3       //
#define    UDFNUML_4       4       //
#define    UDFNUML_5       5       //
#define    UDFNUML_6       6       //
#define    UDFNUML_7       7       //

/* UDFNUMH -  */
#define    UDFNUMH_0       0       //
#define    UDFNUMH_1       1       //
#define    UDFNUMH_2       2       //

/* UDMFN -  */
#define    FNCERR          4       //

/* UEINTX -  */
#define    TXINI           0       //
#define    STALLEDI        1       //
#define    RXOUTI          2       //
#define    RXSTPI          3       //
#define    NAKOUTI         4       //
#define    RWAL            5       //
#define    NAKINI          6       //
#define    FIFOCON         7       //

/* UENUM -  */
#define    UENUM_0         0       //
#define    UENUM_1         1       //
#define    UENUM_2         2       //

/* UERST -  */
#define    EPRST0          0       //
#define    EPRST1          1       //
#define    EPRST2          2       //
#define    EPRST3          3       //
#define    EPRST4          4       //
#define    EPRST5          5       //
#define    EPRST6          6       //

/* UECONX -  */
#define    EPEN            0       //
#define    RSTDT           3       //
#define    STALLRQC        4       //
#define    STALLRQ         5       //

/* UECFG0X -  */
#define    EPDIR           0       //
#define    NYETDIS         1       //
#define    AUTOSW          2       //
#define    ISOSW           3       //
#define    EPTYPE0         6       //
#define    EPTYPE1         7       //

/* UECFG1X -  */
#define    ALLOC           1       //
#define    EPBK0           2       //
#define    EPBK1           3       //
#define    EPSIZE0         4       //
#define    EPSIZE1         5       //
#define    EPSIZE2         6       //

/* UESTA0X -  */
#define    NBUSYBK0        0       //
#define    NBUSYBK1        1       //
#define    DTSEQ0          2       //
#define    DTSEQ1          3       //
#define    ZLPSEEN         4       //
#define    UNDERFI         5       //
#define    OVERFI          6       //
#define    CFGOK           7       //

/* UESTA1X -  */
#define    CURRBK0         0       //
#define    CURRBK1         1       //
#define    CTRLDIR         2       //

/* UEIENX -  */
#define    TXINE           0       //
#define    STALLEDE        1       //
#define    RXOUTE          2       //
#define    RXSTPE          3       //
#define    NAKOUTE         4       //
#define    NAKINE          6       //
#define    FLERRE          7       //

/* UEDATX -  */
#define    UEDATX_0        0       //
#define    UEDATX_1        1       //
#define    UEDATX_2        2       //
#define    UEDATX_3        3       //
#define    UEDATX_4        4       //
#define    UEDATX_5        5       //
#define    UEDATX_6        6       //
#define    UEDATX_7        7       //

/* UEBCLX -  */
#define    UEBCLX_0        0       //
#define    UEBCLX_1        1       //
#define    UEBCLX_2        2       //
#define    UEBCLX_3        3       //
#define    UEBCLX_4        4       //
#define    UEBCLX_5        5       //
#define    UEBCLX_6        6       //
#define    UEBCLX_7        7       //

/* UEBCHX -  */
#define    UEBCHX_0        0       //
#define    UEBCHX_1        1       //
#define    UEBCHX_2        2       //

/* UEINT -  */
#define    UEINT_0         0       //
#define    UEINT_1         1       //
#define    UEINT_2         2       //
#define    UEINT_3         3       //
#define    UEINT_4         4       //
#define    UEINT_5         5       //
#define    UEINT_6         6       //


/* ***** USB_GLOBAL ******************* */

/* USBCON - USB General Control Register */
//#define    VBUSTE          0       //
//#define    IDTE            1       //
//#define    OTGPADE         4       //
#define    FRZCLK          5       //
//#define    HOST            6       //
#define    USBE            7       //

/* USBSTA -  */
//#define    VBUS            0       //
//#define    ID              1       //
//#define    SPEED1          3       //

/* USBINT -  */
//#define    VBUSTI          0       //
//#define    IDTI            1       //

/* ***** USB PS2 ******************** */

/* PS2CON - PS2 Control Register */
#define    PS2EN           0

/* UPOE - USB PS2 Output Enable Register */
#define    UPWE1           7
#define    UPWE0           6
#define    UPDRV1          5
#define    UPDRV0          4
#define    SCKI            3
#define    DATAI           2
#define    DPI             1
#define    DMI             0


/* ***** Clock Switching ************ */

/* CKSEL0 - Clock Selection Register 0 */
#define    RCSUT1          7
#define    RCSUT0          6
#define    EXSUT1          5
#define    EXSUT0          4
#define    RCE             3
#define    EXTE            2
#define    CLKS            0

/* CKSEL1 - Clock Selection Register 1 */
#define    RCCKSEL3        7
#define    RCCKSEL2        6
#define    RCCKSEL1        5
#define    RCCKSEL0        4
#define    EXCKSEL3        3
#define    EXCKSEL2        2
#define    EXCKSEL1        1
#define    EXCKSEL0        0

/* CKSTA  - Clock Status Register */
#define    RCON            1
#define    EXTON           0


/* ***** PLL *********************** */

/* PLLCSR - PLL Control and Status Register */
#define    PLLP2           4
#define    PLLP1           3
#define    PLLP0           2
#define    PLLE            1
#define    PLOCK           0


/* ***** REGULATOR ***************** */

/* REGCR - 3V2 Regulator Control Register */
#define    REGDIS          0


/* Pointer definition */
#define    XL     r26
#define    XH     r27
#define    YL     r28
#define    YH     r29
#define    ZL     r30
#define    ZH     r31

/* PCMSK0 */
#define    PCINT6          6
#define    PCINT5          5
#define    PCINT4          4
#define    PCINT3          3
#define    PCINT2          2
#define    PCINT1          1
#define    PCINT0          0

/* PCMSK1 */
#define    PCINT12         4
#define    PCINT11         3
#define    PCINT10         2
#define    PCINT9          1
#define    PCINT8          0

#endif  /* _MCU_H*/














